## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.example["About-Me"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/about-me-github-runner"
        name                          = "about-me-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["AzArcK8s"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/azarck8s-github-runner"
        name                          = "azarck8s-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["LangChain"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/langchain-github-runner"
        name                          = "langchain-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["OWASPTopTenForL"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/owasptoptenforl-github-runner"
        name                          = "owasptoptenforl-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["Terraform-tech"] will be created
  + resource "azurerm_container_app" "example" {
      + container_app_environment_id  = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/managedEnvironments/Example-Environment"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "terraform-tech-github-runner"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "example-resources"
      + revision_mode                 = "Single"

      + identity {
          + identity_ids = [
              + "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.ManagedIdentity/userAssignedIdentities/example",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + registry {
          + identity = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.ManagedIdentity/userAssignedIdentities/example"
          + server   = "seansacr.azurecr.io"
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "seansacr.azurecr.io/terraform-tech-talk/github_runner_container:latest"
              + memory            = "0.5Gi"
              + name              = "examplecontainerapp"

              + env {
                  + name  = "REPO"
                  + value = "Terraform-tech"
                }
              + env {
                  + name  = "TOKEN"
                  + value = (sensitive value)
                }
            }
        }
    }

  # azurerm_container_app.example["dependabot-trai"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/dependabot-trai-github-runner"
        name                          = "dependabot-trai-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["enable-codeql-l"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/enable-codeql-l-github-runner"
        name                          = "enable-codeql-l-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["github-devsecop"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/github-devsecop-github-runner"
        name                          = "github-devsecop-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["ml-playground"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/ml-playground-github-runner"
        name                          = "ml-playground-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["my-universe-cop"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/my-universe-cop-github-runner"
        name                          = "my-universe-cop-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["remove-commit-h"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/remove-commit-h-github-runner"
        name                          = "remove-commit-h-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["secret-scanning"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/secret-scanning-github-runner"
        name                          = "secret-scanning-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["terraform"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/terraform-github-runner"
        name                          = "terraform-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.example["test-repo"] will be updated in-place
  ~ resource "azurerm_container_app" "example" {
        id                            = "/subscriptions/fe47f131-cb44-477f-82a5-7c19ca0fd15a/resourceGroups/example-resources/providers/Microsoft.App/containerApps/test-repo-github-runner"
        name                          = "test-repo-github-runner"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "examplecontainerapp"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "TOKEN"
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 13 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = [
      + "2good4hisowngood/Terraform-tech-talk",
        "2good4hisowngood/test-repo",
        # (12 unchanged elements hidden)
    ]
```
</details>